{
  "url": "https://www.cnbc.com/2025/06/09/trump-sued-national-guard-la-california-newsom.html",
  "title": "Trump authorizes deploying 2,000 more National Guard troops to LA",
  "content": [
    "PresidentDonald Trumphas authorized deploying another 2,000National Guardtroops toLos Angeles, U.S. officials told the Associated Press on Monday.",
    "CaliforniaGov. Gavin Newsomblasted the new deployment, which was ordered hours after hesued Trumpand Defense SecretaryPete Hegsethfor federalizing the first 2,000 California National Guard troops to be sent to L.A. over the governor's objection.",
    "\"This isn't about public safety. It's about stroking a dangerous President's ego,\" Newsom wrote in apost on X.",
    "\"This is Reckless. Pointless. And Disrespectful to our troops,\" the Democrat wrote.",
    "CNBC has requested comment from the White House.",
    "Earlier Monday, the Defense Department mobilized 700 U.S. Marines to L.A to support Guard troops already deployed there in protecting federal personnel and property during protests over federal immigration enforcement actions.",
    "The mobilization of the Marines from their base inTwentynine Palms, California, is temporary, to give time for additional National Guard troops to arrive, NBC News reported.",
    "Newsom said that the first 2,000 National Guard troops that Trump ordered deployed to L.A. on Saturday night were \"given no food or water.\"",
    "\"Only approx. 300 are deployed — the rest are sitting, unused, in federal buildings without orders,\" Newsom wrote in a tweet.",
    "The American Civil Liberties Union condemned Trump's mobilization of the Marines.",
    "\"Every move President Trump has made since Saturday night has been escalatory and inflammatory,\" Hina Shamsi, director of the National Security Project at the ACLU,\"Hina Shamsi, director of the National Security Project at the ACLU,said in a statement.",
    "\"The idea that these Marines have anywhere near the kind of training required to police protests while respecting people's constitutional rights would be laughable if the situation weren't so alarming,\" Shamsi said.",
    "Trump said Monday that he would support arresting Newsom for purportedly obstructing federal immigration enforcement actions in California.",
    "Trump's comment came in response to questions about his border czar, Tom Homan, who threatened to arrest Newsom, L.A. Mayor Karen Bass, and anyone else who obstructed those actions.",
    "\"I would do it if I were Tom. I think it's great. Gavin likes the publicity, but I think it would be a great thing,\" Trump said.",
    "Newsome fired back.",
    "\"The President of the United States just called for the arrest of a sitting Governor. This is a day I hoped I would never see in America,\" Newsom wrote in a tweet.",
    "The new lawsuit by Newsom and stateAttorney General Rob Bonta, filed in U.S. District Court in San Francisco, asks a judge to rule that Trump's federalization of California's National Guard was unlawful and to set aside the president's order.",
    "Trump in his order cited asection of the U.S. Code, which says a president may call into federal service members of a state's National Guard to repel an invasion by a foreign nation, put down a rebellion, or if the president is unable with regular force to execute U.S. laws.",
    "The civil complaint argued that Trump's action violates the U.S. Constitution and exceeds his authority under federal law related to the National Guard because it occurred without Newsom's consent or input, and because it was not warranted, Bonta said.",
    "Bonta noted that it was only the second time in U.S. history that a president relied on theexclusive authority of the provision to federalize the National Guard, the first time being in 1970, when then-President Richard Nixon called on the National Guard to deliver the mail during a Postal Service strike.",
    "\"This is also the first time since 1965 — when President Johnson sent troops to Alabama to protect civil rights demonstrators, under different federal authority — that a president has activated a State's National Guard without a request from the State's Governor,\" the suit says.",
    "\"President Trump has repeatedly invoked emergency powers to exceed the bounds oflawful executive authority,\" the suit says.",
    "\"On Saturday, June 7, he used a protest that local authorities had under control to make another unprecedented power grab, this time at the cost of the sovereignty of the State of California and in disregard of the authority and role of the Governor as commander-in- chief of the State's National Guard,\" the suit says.",
    "Bonta, during a press conference Monday, said, \"We have a winning case here.\"",
    "\"Let me be clear: There is no invasion. There is no rebellion,\" Bonta said, referring to Trump's use of the protests in L.A. as a pretext for federalizing the Guard.",
    "\"The President is trying to manufacture chaos and crisis on the ground for his own political ends.\"",
    "Meanwhile, federal prosecutors charged labor leader David Huerta with felony conspiracy to impede an officer. Huerta, president of SEUI California, was arrested on Friday during a protest in L.A.",
    "He appeared Monday in federal court, a judge ordered him released on a $50,000 bond, and warned him to keep away from federal agents and federal operations.",
    "Trump on Monday said he made \"a great decision in sending the National Guard to deal with the violent, instigated riots in California.\"",
    "\"If we had not done so, Los Angeles would have been completely obliterated,\" Trump wrote in a social media post.",
    "Trump  also called Newsom \"incompetent,\" and said the governor and L.A. Mayor Karen Bass should be thanking him, saying \"YOU ARE SO WONDERFUL. WE WOULD BE NOTHING WITHOUT YOU, SIR.\"",
    "\"Instead, they choose to lie to the People of California and America by saying that we weren't needed, and that these are \"peaceful protests,\" Trump wrote. \"Just one look at the pictures and videos of the Violence and Destruction tells you all you have to know.\"",
    "Senate Majority Leader Chuck Schumer, D-N.Y., accused Trump of engaging in a \"diversion\" by deploying the Guard.",
    "\"Donald Trump — in the midst of a war with Elon Musk and his ugly tax bill that would rip healthcare from 17 million people — is in desperate need of a diversion,\" Schumer said in a statement.",
    "\"His order to deploy the National Guard in California is unnecessary, inflammatory, and provocative. Trump should immediately revoke his command to use the National Guard, and leave the law enforcement to the governor and the mayor, who are more than capable of handling the situation,\" Schumer said.",
    "\"Americans do not need or deserve this unnecessary and provocative chaos.\""
  ]
}